{"pageid":35109,"pagename":"Password","title":"Password","displaytitle":"Password","revid":14252591,"properties":[{"name":"smw-semanticdata-status","value":""},{"name":"description","value":"A Password is a set of characters which is used to gain access to an account. It is recommended that your password does NOT relate to anything close to you, such as a favourite animal or the address of your house. Rather, it is more recommended that you name your password after a famous person's birthday or something similar that can be re-looked up in the case you forget. A combination of letters and numbers will make a good password."}],"content":"<div class=\"mw-parser-output\"><div class=\"noexcerpt noprint nomobile rs-external-header-links\" style=\"display:none\"><span class=\"rs-header-icon rs-header-icon-rs\" data-text=\"RuneScape\" data-title=\"The RuneScape Wiki also has an article on Password.\" data-site=\"rs\">The RuneScape Wiki also has an article on: <a href=\"https://runescape.wiki/w/Password\" class=\"extiw\" title=\"rsw:Password\">rsw:Password</a></span></div>\n<p>A <b>Password</b> is a set of characters which is used to gain access to an account. It is recommended that your password does NOT relate to anything close to you, such as a favourite animal or the address of your house. Rather, it is more recommended that you name your password after a famous person's birthday or something similar that can be re-looked up in the case you forget. A combination of letters and numbers will make a good password.\n</p><p>Never tell your password to anyone. Anyone that attempts to ask about your password should immediately be reported for <a href=\"/w/Rules_of_RuneScape#Rule_3_-_Password_Scamming\" class=\"mw-redirect\" title=\"Rules of RuneScape\">Rule 3</a>. There is also a system that prevents any IP address from accessing any <i><a href=\"/w/RuneScape\" class=\"mw-redirect\" title=\"RuneScape\">RuneScape</a></i> account if five or more incorrect passwords are tried in succession, doing that can be recognised that you are on a hacking attempt.\n</p>\n<h2><span class=\"mw-headline\" id=\"Changing_your_password\">Changing your password</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/w/Password?section=1&amp;veaction=edit\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Changing your password\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/w/Password?action=edit&amp;section=1\" title=\"Edit section: Changing your password\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>To change your password hover your mouse over \"Account\" on the bar located just below the advertisement on the <i>Runescape</i> or <i>Funorb</i> home pages, then select Account Management option from the drop down box that will appear. An option to change your password will then be shown. When selected, this will redirect you to a <a href=\"/w/Jagex\" title=\"Jagex\">Jagex</a> site where you will be asked to enter your present password as well as your new password. Once accepted, the new password takes effect immediately.\n</p><p>It is strongly advised to run virus protection software <i>prior</i> to changing your password, especially if you suspect your computer might be infected by a keylogger or you have any other security concerns, or use a different computer of which you know it is secure.\n</p>\n<h2><span class=\"mw-headline\" id=\"General_password_security\">General password security</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/w/Password?section=2&amp;veaction=edit\" class=\"mw-editsection-visualeditor\" title=\"Edit section: General password security\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/w/Password?action=edit&amp;section=2\" title=\"Edit section: General password security\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p><i>The following uses content directly from the RuneScape website.</i>\n</p>\n<table align=\"center\" style=\"border-collapse:collapse; border-style:none; background-color:transparent;\">\n<tbody><tr>\n<td class=\"quotation-mark\" style=\"width:20px; vertical-align:top; font-size:40px; font-family:serif; font-weight:bold; text-align:left; padding:10px 10px;\">“\n</td>\n<td style=\"vertical-align:top; padding:4px 10px;\">\n<ul><li><b>DO NOT</b> pick any word or number which has a connection to you, so don't pick your favourite animal or your house number.</li>\n<li><b>DO NOT</b> use your phone number or any personal information as your password. This can be easily guessed by a friend or relative.</li>\n<li><b>DO NOT</b> just use a number at the end of a word, such as apple1.</li>\n<li><b>DO NOT</b> use common number and letter substitutions e.g. 4 as the word 'for', 1 as 'L' or 'I', 5 as 'S'</li>\n<li><b>DO NOT</b> use repeating characters 'bbbbbbbbbb' or series of characters such as 'kbkbkbkbkbkb' or also something like 'rs2rs2rs2rs2'.</li>\n<li><b>DO NOT</b> use your real name, account name or name of an item either forwards, backwards or divided up.</li>\n<li><b>DO NOT</b> use a series of characters off any keyboard such as 'adfsghd', 'lkjhgf' or 'qazwsxedc', as these are very common and hijackers will look for these.</li>\n<li><b>DO NOT</b> fall for users saying that the system will censor your password.</li>\n<li><b>DO NOT</b> give your password to anyone. This includes any friends, relatives, or other player. If asked in-game for it, report the player under Rule 3 - Password Scamming.</li>\n<li><b>DO NOT</b> use a password that you've previously used on your account.</li>\n<li><b>DO NOT</b> combine your RuneScape password with other things such as your E-mail account. If the password for one is discovered, access to your RuneScape account becomes much easier for hijackers.</li>\n<li><b>DO NOT</b> use your RuneScape password a second time for an account on another website, or for secondary RuneScape account.</li>\n<li>Be careful about keeping your RuneScape password in places where it may be accidentally discovered, like in a Microsoft Word document.</li>\n<li>Passwords should range from 5 to 20 characters. The more characters there are, the less likely it is to have your account stolen.</li>\n<li>Passwords should not be entered if there is someone directly behind you. Long passwords with no discernible pattern of words and numbers like \"ag955gop233xz521\" are very difficult to memorise at a glance. Do <b>not</b> use <i>ag955gop233xz521</i> as your password, since this might be guessed by an account hi-jacker.</li>\n<li>Jagex moderators will <b>never</b> ask you for your RuneScape password. Any player who claims to be Jagex staff should be reported either for Rule 3 - Password Scamming, or Rule 5 - Jagex Impersonation.</li>\n<li>Passwords should <b>never</b> be entered on any website besides <b>runescape.com</b> or <b>jagex.com</b>. The same rule applies to RuneScape fansites as well - including the RuneScape Wiki - as many non-legitimate websites have keyloggers, which record and steal players' passwords.</li>\n<li>It is advisable to change your password every 3 to 6 months, so long as you keep it safe.</li></ul>\n</td>\n<td class=\"quotation-mark\" style=\"width:20px; vertical-align:bottom; font-size:40px; font-family:serif; font-weight:bold; text-align:right; padding:10px 10px;\">”\n</td></tr>\n\n</tbody></table>\n<!-- \nNewPP limit report\nParsed by mediawiki‐67df7655d‐7qtxl\nCached time: 20220421165039\nCache expiry: 86400\nReduced expiry: false\nComplications: []\n[SMW] In‐text annotation parser time: 0.001 seconds\nCPU time usage: 0.025 seconds\nReal time usage: 0.031 seconds\nPreprocessor visited node count: 52/1000000\nPost‐expand include size: 3766/2097152 bytes\nTemplate argument size: 2662/2097152 bytes\nHighest expansion depth: 4/100\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\nLua time usage: 0.003/10.000 seconds\nLua memory usage: 525645/367001600 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   16.416      1 -total\n 86.15%   14.142      1 Template:External\n 13.02%    2.138      1 Template:Cquote2\n-->\n\n<!-- Saved in parser cache with key en_osrswiki:pcache:idhash:35109-0!canonical and timestamp 20220421165039 and revision id 14252591. Serialized with PHP.\n -->\n</div>","rawContent":"{{External|rs}}\nA '''Password''' is a set of characters which is used to gain access to an account. It is recommended that your password does NOT relate to anything close to you, such as a favourite animal or the address of your house. Rather, it is more recommended that you name your password after a famous person's birthday or something similar that can be re-looked up in the case you forget. A combination of letters and numbers will make a good password.\n\nNever tell your password to anyone. Anyone that attempts to ask about your password should immediately be reported for [[Rules of RuneScape#Rule 3 - Password Scamming|Rule 3]]. There is also a system that prevents any IP address from accessing any ''[[RuneScape]]'' account if five or more incorrect passwords are tried in succession, doing that can be recognised that you are on a hacking attempt.\n\n==Changing your password==\nTo change your password hover your mouse over \"Account\" on the bar located just below the advertisement on the ''Runescape'' or ''Funorb'' home pages, then select Account Management option from the drop down box that will appear. An option to change your password will then be shown. When selected, this will redirect you to a [[Jagex]] site where you will be asked to enter your present password as well as your new password. Once accepted, the new password takes effect immediately.\n\nIt is strongly advised to run virus protection software ''prior'' to changing your password, especially if you suspect your computer might be infected by a keylogger or you have any other security concerns, or use a different computer of which you know it is secure.\n\n==General password security==\n''The following uses content directly from the RuneScape website.''\n{{Cquote2|\n*'''DO NOT''' pick any word or number which has a connection to you, so don't pick your favourite animal or your house number.\n*'''DO NOT''' use your phone number or any personal information as your password. This can be easily guessed by a friend or relative.\n*'''DO NOT''' just use a number at the end of a word, such as apple1.\n*'''DO NOT''' use common number and letter substitutions e.g. 4 as the word 'for', 1 as 'L' or 'I', 5 as 'S'\n*'''DO NOT''' use repeating characters 'bbbbbbbbbb' or series of characters such as 'kbkbkbkbkbkb' or also something like 'rs2rs2rs2rs2'.\n*'''DO NOT''' use your real name, account name or name of an item either forwards, backwards or divided up.\n*'''DO NOT''' use a series of characters off any keyboard such as 'adfsghd', 'lkjhgf' or 'qazwsxedc', as these are very common and hijackers will look for these.\n*'''DO NOT''' fall for users saying that the system will censor your password.\n*'''DO NOT''' give your password to anyone. This includes any friends, relatives, or other player. If asked in-game for it, report the player under Rule 3 - Password Scamming.\n*'''DO NOT''' use a password that you've previously used on your account.\n*'''DO NOT''' combine your RuneScape password with other things such as your E-mail account. If the password for one is discovered, access to your RuneScape account becomes much easier for hijackers.\n*'''DO NOT''' use your RuneScape password a second time for an account on another website, or for secondary RuneScape account.\n*Be careful about keeping your RuneScape password in places where it may be accidentally discovered, like in a Microsoft Word document.\n*Passwords should range from 5 to 20 characters. The more characters there are, the less likely it is to have your account stolen.\n*Passwords should not be entered if there is someone directly behind you. Long passwords with no discernible pattern of words and numbers like \"ag955gop233xz521\" are very difficult to memorise at a glance. Do '''not''' use ''ag955gop233xz521'' as your password, since this might be guessed by an account hi-jacker.\n*Jagex moderators will '''never''' ask you for your RuneScape password. Any player who claims to be Jagex staff should be reported either for Rule 3 - Password Scamming, or Rule 5 - Jagex Impersonation.\n*Passwords should '''never''' be entered on any website besides '''runescape.com''' or '''jagex.com'''. The same rule applies to RuneScape fansites as well - including the RuneScape Wiki - as many non-legitimate websites have keyloggers, which record and steal players' passwords.\n*It is advisable to change your password every 3 to 6 months, so long as you keep it safe.\n}}\n[[Category:Mechanics]]\n[[Category:Security]]"}