{"pageid":9702,"pagename":"Door","title":"Door","displaytitle":"Door","revid":14094402,"properties":[{"name":"smw-semanticdata-status","value":""},{"name":"description","value":"A door or a gate is an entrance (or exit) in a wall or fence, which sometimes acts as a passage through a physical boundary. It could be an entrance into a city, into a building, into a room, or into a field (especially when outdoors). The names of particular doors or gates may include an adjective or other qualifier. For example, the guards' entrance to the Black Knights' Fortress is marked by a sturdy door."}],"content":"<div class=\"mw-parser-output\"><div class=\"noexcerpt noprint nomobile rs-external-header-links\" style=\"display:none\"><span class=\"rs-header-icon rs-header-icon-rs\" data-text=\"RuneScape\" data-title=\"The RuneScape Wiki also has an article on Door.\" data-site=\"rs\">The RuneScape Wiki also has an article on: <a href=\"https://runescape.wiki/w/Door\" class=\"extiw\" title=\"rsw:Door\">rsw:Door</a></span><span class=\"rs-header-icon rs-header-icon-rsc\" data-text=\"CS\" data-title=\"The RuneScape Classic Wiki also has an article on Doors.\" data-site=\"rsc\">The RuneScape Classic Wiki also has an article on: <a href=\"https://classic.runescape.wiki/w/Doors\" class=\"extiw\" title=\"classicrsw:Doors\">classicrsw:Doors</a></span></div>\n<p>A <b>door</b> or a <b>gate</b> is an entrance (or exit) in a wall or fence, which sometimes acts as a passage through a <a href=\"/w/Physical_boundary\" title=\"Physical boundary\">physical boundary</a>. It could be an entrance into a city, into a building, into a room, or into a field (especially when outdoors). The names of particular doors or gates may include an <a href=\"https://en.wikipedia.org/wiki/adjective\" class=\"extiw\" title=\"wikipedia:adjective\"><span title=\"&quot;adjective&quot; on English Wikipedia\">adjective</span></a> or other qualifier. For example, the guards' entrance to the <a href=\"/w/Black_Knights%27_Fortress_(location)\" title=\"Black Knights&#39; Fortress (location)\">Black Knights' Fortress</a> is marked by a <b>sturdy door</b>.\n</p><p>The buildings in <a href=\"/w/Al_Kharid\" title=\"Al Kharid\">Al Kharid</a> and the <a href=\"/w/Kharidian_Desert\" title=\"Kharidian Desert\">Kharidian Desert</a> have a <b>curtain</b> that serves in place of a door. A <b>trapdoor</b> is a similar concept, except that it allows passage vertically downwards from one story to another. It always has a ladder, a <a href=\"/w/Staircase\" title=\"Staircase\">staircase</a>, steps or a rope below to allow passage back up again.\n</p><p>Walls appear as white lines on the <a href=\"/w/Minimap\" title=\"Minimap\">minimap</a> and the <a href=\"/w/World_map\" title=\"World map\">world map</a>, with doors represented by red markers. Players can pass through an open door simply by left-clicking on a location or object on the other side of it, either in the main playing area or on the <a href=\"/w/Minimap\" title=\"Minimap\">minimap</a>. See <a href=\"/w/Game_controls\" title=\"Game controls\">Game controls</a> for more information on moving around and on using less-common pointing devices. The character will walk through the doorway as it is no obstacle at all.\n</p><p>A closed door acts as a <a href=\"/w/Physical_boundary\" title=\"Physical boundary\">physical boundary</a>. If it is unlocked, players can open it simply by left-clicking on it. Characters will not open a door automatically, and open doors may close after 300 seconds. Many players find this frustrating, although it may be compared to a gameworld respawn. Doors are special movable game objects and have a respawn clock just like any other object. While a longer delay could be used, the relatively short timer is presumably to cripple simple <a href=\"/w/Macro\" class=\"mw-redirect\" title=\"Macro\">macros</a> that are unable to open doors.\n</p><p>Some doors are locked, but players can often unlock them via the <a href=\"/w/Thieving\" title=\"Thieving\">Thieving</a> skill. For example, the entrance to the <a href=\"/w/H.A.M._Dungeon\" class=\"mw-redirect\" title=\"H.A.M. Dungeon\">H.A.M. Dungeon</a> is marked by a locked trapdoor. Players must pick the lock in order to gain access. A <a href=\"/w/Lockpick\" title=\"Lockpick\">lockpick</a> may be useful or even necessary to unlock some doors in this way. Some locked doors can only be unlocked with a <a href=\"/w/List_of_keys\" title=\"List of keys\">key</a>, usually as part of a <a href=\"/w/Quests\" title=\"Quests\">quest</a>.\n</p><p>Players can close an open door by left-clicking on it (notice that the door itself must be clicked on, not the doorway). This can be used to prevent other players or monsters from getting out of a room, effectively trapping them inside. In the past, this could be done maliciously, for example to trap a player in a room with dangerous <a href=\"/w/Random_events\" title=\"Random events\">random events</a> like the <a href=\"/w/Evil_chicken\" class=\"mw-redirect\" title=\"Evil chicken\">evil chicken</a> or a <a href=\"/w/Shade_(random_event)\" class=\"mw-redirect\" title=\"Shade (random event)\">shade</a>, although the discontinuation of those dangerous events makes that no longer a problem.\n</p><p>After many complaints from players, any given player can only close a door up to five times in quick succession. After this, they will be greeted with the message: \"The door seems to be stuck.\"If they try to close an open door, they can however still open closed doors. However, some doors, such as the doors in the <a href=\"/w/Piscatoris_Fishing_Colony\" title=\"Piscatoris Fishing Colony\">Piscatoris Fishing Colony</a> and in all banks, cannot be closed by players to avoid locking players out.\n</p>\n<h2><span class=\"mw-headline\" id=\"Trivia\">Trivia</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/w/Door?section=1&amp;veaction=edit\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Trivia\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/w/Door?action=edit&amp;section=1\" title=\"Edit section: Trivia\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<ul><li>If a player tries to light a fire in front of a closed door, a message \"You can't light a fire here.\" will appear. However, if the door is open, the player is not restricted from lighting a fire in front of it.</li>\n<li>There is a glitch in which certain doors will sometimes appear both open and closed at the same time. If the door is supposed to be open, it may appear as though <a href=\"/w/Players\" class=\"mw-redirect\" title=\"Players\">players</a> are walking through a closed door. This appears most often at the <a href=\"/w/Catherby\" title=\"Catherby\">Catherby</a> <a href=\"/w/Range\" title=\"Range\">range</a> or other places where a high number of players are entering a room.</li>\n<li>There was a glitch with the eastern door at the <a href=\"/w/Lumbridge\" title=\"Lumbridge\">Lumbridge</a> <a href=\"/w/General_store\" title=\"General store\">general store</a>. Although players could enter through it, it was impossible to <b>walk</b> out the door; players had to <a href=\"/w/Run\" class=\"mw-redirect\" title=\"Run\">run</a> in order to get through.</li>\n<li>Some doors in the ground floor of the <a href=\"/w/Wizards%27_Tower\" title=\"Wizards&#39; Tower\">Wizards' Tower</a> are at an angle which crosses over a square. If a player stands <i>in</i> the doorway and another player closes it, the player in the doorway has the door passing through them. They can then walk out of either side of the door.</li>\n<li>On <a href=\"/w/White_Wolf_Mountain\" title=\"White Wolf Mountain\">White Wolf Mountain</a>, there is a trapdoor on the northern-most side that when you examine it, it says \"Don't you open that trapdoor!\" This is a line of a song taken from <i><a href=\"https://en.wikipedia.org/wiki/The_Trap_Door\" class=\"extiw\" title=\"wikipedia:The Trap Door\"><span title=\"&quot;The Trap Door&quot; on English Wikipedia\">The Trap Door</span></a></i>, a children's cartoon.</li>\n<li>There seems to be a glitch when the Lumbridge Home Teleport spell is cast. When the character is drawing the circle, then quickly opens a closed door in direct vicinity, the character will freeze for a moment, and the door will be open, even though the character has not yet turned to open it.</li>\n<li>If a player opens and closes a door enough times in a short period of time, the door will become stuck open. The player will also receive the message: 'The door seems to be stuck.' This is to avoid players from trapping other players inside/outside buildings.</li>\n<li>There was an unusable door in the north of <a href=\"/w/Shilo_Village_(location)\" title=\"Shilo Village (location)\">Shilo Village</a>, on the top floor of the tower where <a href=\"/w/Duradel\" title=\"Duradel\">Duradel</a> lives. If you tried to open it, for some reason it would say \"I don't think that's possible\".</li>\n<li>There is currently a glitch when you open and close a door repeatedly; it seems as if you walk through the door.</li>\n<li>Almost all of the doors in Runescape have no animation. When you decide to click it, it just pops open without movement.</li></ul>\n<h2><span class=\"mw-headline\" id=\"See_also\">See also</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/w/Door?section=2&amp;veaction=edit\" class=\"mw-editsection-visualeditor\" title=\"Edit section: See also\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/w/Door?action=edit&amp;section=2\" title=\"Edit section: See also\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<ul><li><a href=\"/w/Ladder\" title=\"Ladder\">Ladder</a></li>\n<li><a href=\"/w/Staircase\" title=\"Staircase\">Staircase</a></li></ul>\n<!-- \nNewPP limit report\nParsed by mediawiki‐67df7655d‐7qtxl\nCached time: 20220421160938\nCache expiry: 86400\nReduced expiry: false\nComplications: []\n[SMW] In‐text annotation parser time: 0.001 seconds\nCPU time usage: 0.030 seconds\nReal time usage: 0.039 seconds\nPreprocessor visited node count: 67/1000000\nPost‐expand include size: 1258/2097152 bytes\nTemplate argument size: 66/2097152 bytes\nHighest expansion depth: 3/100\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\nLua time usage: 0.003/10.000 seconds\nLua memory usage: 525637/367001600 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%   16.426      1 -total\n 87.25%   14.331      1 Template:External\n 10.98%    1.804      2 Template:Wp\n-->\n\n<!-- Saved in parser cache with key en_osrswiki:pcache:idhash:9702-0!canonical and timestamp 20220421160938 and revision id 14094402. Serialized with PHP.\n -->\n</div>","rawContent":"{{External|rs|rsc=Doors}}\nA '''door''' or a '''gate''' is an entrance (or exit) in a wall or fence, which sometimes acts as a passage through a [[physical boundary]]. It could be an entrance into a city, into a building, into a room, or into a field (especially when outdoors). The names of particular doors or gates may include an {{wp|adjective}} or other qualifier. For example, the guards' entrance to the [[Black Knights' Fortress (location)|Black Knights' Fortress]] is marked by a '''sturdy door'''.\n\nThe buildings in [[Al Kharid]] and the [[Kharidian Desert]] have a '''curtain''' that serves in place of a door. A '''trapdoor''' is a similar concept, except that it allows passage vertically downwards from one story to another. It always has a ladder, a [[staircase]], steps or a rope below to allow passage back up again.\n\nWalls appear as white lines on the [[minimap]] and the [[world map]], with doors represented by red markers. Players can pass through an open door simply by left-clicking on a location or object on the other side of it, either in the main playing area or on the [[minimap]]. See [[Game controls]] for more information on moving around and on using less-common pointing devices. The character will walk through the doorway as it is no obstacle at all.\n\nA closed door acts as a [[physical boundary]]. If it is unlocked, players can open it simply by left-clicking on it. Characters will not open a door automatically, and open doors may close after 300 seconds. Many players find this frustrating, although it may be compared to a gameworld respawn. Doors are special movable game objects and have a respawn clock just like any other object. While a longer delay could be used, the relatively short timer is presumably to cripple simple [[macro]]s that are unable to open doors.\n\nSome doors are locked, but players can often unlock them via the [[Thieving]] skill. For example, the entrance to the [[H.A.M. Dungeon]] is marked by a locked trapdoor. Players must pick the lock in order to gain access. A [[lockpick]] may be useful or even necessary to unlock some doors in this way. Some locked doors can only be unlocked with a [[List of keys|key]], usually as part of a [[Quests|quest]].\n\nPlayers can close an open door by left-clicking on it (notice that the door itself must be clicked on, not the doorway). This can be used to prevent other players or monsters from getting out of a room, effectively trapping them inside. In the past, this could be done maliciously, for example to trap a player in a room with dangerous [[random events]] like the [[evil chicken]] or a [[Shade (random event)|shade]], although the discontinuation of those dangerous events makes that no longer a problem.\n\nAfter many complaints from players, any given player can only close a door up to five times in quick succession. After this, they will be greeted with the message: \"The door seems to be stuck.\"If they try to close an open door, they can however still open closed doors. However, some doors, such as the doors in the [[Piscatoris Fishing Colony]] and in all banks, cannot be closed by players to avoid locking players out.\n\n==Trivia==\n*If a player tries to light a fire in front of a closed door, a message \"You can't light a fire here.\" will appear. However, if the door is open, the player is not restricted from lighting a fire in front of it.\n*There is a glitch in which certain doors will sometimes appear both open and closed at the same time. If the door is supposed to be open, it may appear as though [[players]] are walking through a closed door. This appears most often at the [[Catherby]] [[range]] or other places where a high number of players are entering a room.\n*There was a glitch with the eastern door at the [[Lumbridge]] [[general store]]. Although players could enter through it, it was impossible to '''walk''' out the door; players had to [[run]] in order to get through.\n*Some doors in the ground floor of the [[Wizards' Tower]] are at an angle which crosses over a square. If a player stands ''in'' the doorway and another player closes it, the player in the doorway has the door passing through them. They can then walk out of either side of the door.\n*On [[White Wolf Mountain]], there is a trapdoor on the northern-most side that when you examine it, it says \"Don't you open that trapdoor!\" This is a line of a song taken from ''{{wp|The Trap Door}}'', a children's cartoon.\n*There seems to be a glitch when the Lumbridge Home Teleport spell is cast. When the character is drawing the circle, then quickly opens a closed door in direct vicinity, the character will freeze for a moment, and the door will be open, even though the character has not yet turned to open it.\n*If a player opens and closes a door enough times in a short period of time, the door will become stuck open. The player will also receive the message: 'The door seems to be stuck.' This is to avoid players from trapping other players inside/outside buildings.\n*There was an unusable door in the north of [[Shilo Village (location)|Shilo Village]], on the top floor of the tower where [[Duradel]] lives. If you tried to open it, for some reason it would say \"I don't think that's possible\".\n*There is currently a glitch when you open and close a door repeatedly; it seems as if you walk through the door.\n*Almost all of the doors in Runescape have no animation. When you decide to click it, it just pops open without movement.\n\n==See also==\n*[[Ladder]]\n*[[Staircase]]\n[[Category:Interactive scenery]]\n[[Category:Mechanics]]"}